Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.TopographyLink
An external resource type representing Topography Links.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.RevitLink
An external resource type representing Revit Links data.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.PointCloud
An external resource type representing Point Clouds.
This type is reserved for future expansion but not yet implemented.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.KeynoteTable
An external resource type representing keynote data.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.IFCLink
An external resource type representing IFC links.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.FabricationConfiguration
An external resource type representing an MEP fabrication configuration.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalMap
An external resource type representing Decal linked data for diffuse.
This type is reserved for future expansion but not yet implemented.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalCutOut
An external resource type representing Decal linked data for cut out opacity.
This type is reserved for future expansion but not yet implemented.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalBumpMap
An external resource type representing Decal linked data for bump map.
This type is reserved for future expansion but not yet implemented.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DWFMarkup
An external resource type representing DWF markups data.
This type is reserved for future expansion but not yet implemented.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.CADLink
An external resource type representing CAD Links data.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.AssemblyCodeTable
An external resource type representing assembly code data.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes
A collection of ids of the ExternalResourceTypes provided by Revit.